
{"recipes" :
    [{"recipe-name":"Thai Cucumber Salad",
     "vegan": true,
     "vegetarian": true,
     "prepTime": 15,
     "servings": 6,
     "price": 2.84,
     "ingredients": ["1/3 cup of rice vinegar",
                     "2 tbsp of granulated sugar",
                     "1/2 tsp of toasted sesame oil",
                     "1/4 tsp of red pepper flakes",
                     "2 cucumbers",
                     "3 green onions",
                     "1/4 cup of chopped peanuts"
                     ],
     "instructions": [
                      "In a small bowl, combine the rice vinegar, sugar, sesame oil, red pepper flakes, and salt. Set the dressing aside to give it time to blend.",
                      "Peel and slice the cucumber using your favorite method. Place the sliced cucumbers in a large bowl.",
                      "Chop the peanuts into smaller pieces, if desired. Slice the green onions.",
                      "Add the dressing, peanuts, and green onions to the sliced cucumbers. Stir to combine. Serve immediately or refrigerate until ready to eat. Give the salad a brief stir before serving to redistribute the dressing and flavors."
                      ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2016/04/Thai-Cucumber-Salad-front.jpg"
     },
     {
     "recipe-name":"Southwest Chicken Skillet",
     "vegan": false,
     "vegetarian": false,
     "prepTime": 5,
     "servings": 4,
     "price": 6.76,
     "ingredients": ["1 cup of uncooked long grain white rice",
                     "1 cup of salsa",
                     "1.5-2 cups of precooked shredded chicken",
                     "15 oz can of black beans",
                     "1 tbsp of chili powder",
                     "1 and 3/4 cups of chicken broth",
                     "1 cup of shredded cheese",
                     "2-3 green onions sliced"
                     ],
     "instructions": [
                      "In a large skillet, combine the rice, salsa, chicken, black beans (drained), chili powder, and chicken broth. Stir until everything is evenly combined.",
                      "Place a tight fitting lid on the skillet, turn the heat on to high, and let the skillet come to a full boil. As soon as the skillet comes to a boil, turn the heat down to low and let it simmer for 15 minutes. Make sure it is simmering the entire time, turning the heat up slightly if needed (you should be able to hear it simmer quietly).",
                      "After 15 minutes, turn off the heat, and let it rest with the lid in place for 5 more minutes. Finally, remove the lid, and fluff the mixture with a fork. All of the liquid should be absorbed and the rice should be tender. Sprinkle 1 cup of shredded cheese over top, replace the lid, and let it sit for a few minutes, or until the cheese is melted. Meanwhile, slice the green onions. Sprinkle the green onions over the melted cheese and serve hot."
                      ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2014/05/Southwest-Chicken-Skillet-bowl.jpg"
     },
     {
     "recipe-name":"Coconut Crusted Tofu with Sweet Chili Dipping Sauce",
     "vegan": false,
     "vegetarian": true,
     "prepTime": 45,
     "servings": 4,
     "price": 8.69,
     "ingredients": ["14 oz block of extra firm tofu",
                     "1 large egg",
                     "2 tbsp of cornstarch",
                     "1 tbsp of water",
                     "A pinch of salt and pepper",
                     "1 cup of unsweetened coconut flakes",
                     "2 tbsp of virgin coconut oil",
                     "3 oz of sweet chili sauce"
                     ],
     "instructions": [
                      "Remove the tofu from the liquid filled package and place it between multiple layers of paper towel or a clean, lint-free dish towel. Place the wrapped tofu between two plates, cutting boards, or baking sheets and place something heavy on top (I use a kettle or pot full of water). Press the tofu for 30 minutes.",
                      "Once the tofu has been pressed, cut the block in half. Cut each piece into three 1/4-inch thick rectangles (cut the thickness of the block into three). Cut each rectangle into two triangles. You should now have 12 1/4-inch thick triangles.",
                      "Prepare two bowls for the coconut crust. In the first bowl whisk together the egg, cornstarch, water, and a pinch of salt and pepper until a smooth mixture forms. Place the unsweetened coconut in the second bowl.",
                      "Dip each tofu triangle into the egg mixture first, making sure it is fully coated, then into the coconut flakes. Place the coconut coated triangles on the cutting board until all pieces are coated.",
                      "Heat one tablespoon of the coconut oil in a large non-stick skillet over medium heat. Once the skillet and oil are hot, add half of the coconut coated tofu triangles and cook on each side until brown and crispy. Remove the cooked tofu to a paper towel lined plate, add more coconut oil, and cook the second batch.",
                      "Serve the crispy coconut crusted tofu with sweet chili sauce for dipping."
                      ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2017/06/Coconut-Crusted-Tofu-close.jpg"
     },
     {
     "recipe-name":"Honey Sriracha Chicken Thighs",
     "vegan": false,
     "vegetarian": false,
     "prepTime": 40,
     "servings": 6,
     "price": 7.29,
     "ingredients": ["6 boneless skinless chicken thighs",
                     "2 cloves of garlic",
                     "1 inch of fresh ginger",
                     "2 tbsp of sriracha hot sauce",
                     "1 and 1/2 tbsp of soy sauce",
                     "1 tbsp of rice vinegar",
                     "2 tbsp of honey",
                     "2 tbsp of brown sugar",
                     "1 tbsp of vegetable oil",
                     "1/2 cup of water",
                     "2 tbsp of corn starch",
                     "1/4 bunch of cilantro or green onion"
                     ],
     "instructions": [
                      "Mince the garlic and grate the ginger into a bowl. Add the sriracha, soy sauce, rice vinegar, honey, brown sugar, vegetable oil, and water. Stir to combine. Add the corn starch and stir until dissolved.",
                      "Add the chicken thighs to a large zip top bag or a shallow dish. Add half of the marinade/sauce mixture to the chicken and toss to coat (be sure to stir the sauce before adding it to the chicken. The garlic, ginger, and corn starch tend to settle to the bottom.) Refrigerate for 30 minutes. Save the unused portion of the marinade for later.",
                      "Preheat the oven to 400 degrees. Add the chicken and its marinade to a 8x8 inch casserole dish. Bake in the preheated oven for 30 minutes, basting the chicken with the juices half way through.",
                      "While the chicken is baking, add the second reserved marinade (the half that wasn't used with the chicken) to a small sauce pot. Bring it up to a simmer over medium heat while stirring. As soon as it reaches a simmer it will thicken into a nice glaze. Set the sauce aside.",
                      "When the chicken is finished baking, spread the thickened sauce over each piece of chicken. Add fresh cilantro or sliced green onions and serve."
                      ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2013/12/Sriracha-Chicken-Thighs-above.jpg"
     },
     {
     "recipe-name":"Almond Apricot Biscotti",
     "vegan": false,
     "vegetarian": true,
     "prepTime": 15,
     "servings": 28,
     "price": 3.57,
     "ingredients": ["2 cups of all-purpose flour",
                     "1 tsp of baking powder",
                     "1/4 tsp of salt",
                     "1 cup of sugar",
                     "4 tbsp of butter at room temperature",
                     "2 large eggs",
                     "1/2 tsp of vanilla extract",
                     "1 tsp of almond extract",
                     "1/4 tsp of nutmeg",
                     "1/3 cup of sliced almonds",
                     "1/3 cup of dried apricots, about 8 pieces"
                     ],
     "instructions": [
                      "Preheat the oven to 350ºF. In a medium bowl, stir together the flour, baking powder, and salt until evenly mixed.",
                      "In a large bowl, beat together the sugar, butter, eggs, vanilla extract, almond extract, and nutmeg until the mixture is light and creamy in appearance.",
                      "Pour the dry ingredients into the bowl of wet ingredients and stir until a soft dough forms.",
                      "Chop the apricots into small pieces. Add the chopped apricots and sliced almonds to the bowl with the dough, then stir until they are mixed in. Save a few pieces of almond to press into the top of the biscotti.",
                      "Line a baking sheet with parchment paper. Divide the dough into two equal pieces, then shape each into a flattened log, about 3 inches wide and 12 inches long. Place the logs a few inches apart on the baking sheet. Press a few pieces of almonds into the top of the dough for decoration. Bake the biscotti logs for 35 minutes in the preheated oven, or just until the edges turn golden and the top has a few cracks.",
                      "Remove the biscotti from the oven, but don't turn it off. Let the biscotti cool for about five minutes, then carefully transfer them to a cutting board. Use a serrated knife to cut the biscotti, on an angle, into 3/4-inch wide slices. Place the slices on back on the baking sheet, cut sides up.",
                      "Bake the sliced biscotti for about five more minutes, then flip and bake for five minutes on the second side. Allow the biscotti to cool completely before serving or packing in an air-tight container."
                      ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2017/01/Almond-Apricot-Biscotti-front.jpg"
     },
     {
     "recipe-name":"Mediterranean Tuna Pasta",
     "vegan": false,
     "vegetarian": false,
     "prepTime": 10,
     "servings": 4,
     "price": 13.23,
     "ingredients": ["2 tbsp of olive oil",
                     "1 medium onion",
                     "1/2 tbsp of minced garlic",
                     "4-5 anchovy filets",
                     "1 28 oz. can of diced or crushed tomatoes",
                     "1/2 cup of kalamata olives",
                     "1/2 tbsp of dried basil",
                     "1/4 tsp of crushed red pepper",
                     "1/2 tsp of salt",
                     "cracked black pepper",
                     "2 medium squash (green, yellow)",
                     "12 oz. tuna steaks",
                     "1/4 bunch of fresh parsley",
                     "1/2 lb pasta"
                     ],
     "instructions": [
                      "Dice the onion and cook it in a large skillet along with the minced garlic, anchovy filets and olive oil. Cook until the onions are soft and transparent and the anchovies have dissolved.",
                      "Meanwhile, cut the squash into half rounds or quarters. Add the squash to the skillet and continue to saute until they are slightly softened.",
                      "Add the can of tomatoes, roughly chopped olives, basil, crushed red pepper, salt, and cracked black pepper. Stir to combine. Nestle the tuna steaks down into the sauce, place a lid on top and let simmer until the tuna is cooked through. The tuna will turn from mauve to white as it cooks. When it is completely white, it is done.",
                      "While the tuna is poaching in the sauce, cook the pasta according to the package directions (boil for 5-7 minutes or until al dente). When the pasta is finished, drain in a colander.",
                      "When the fish and pasta are finished cooking, gently lift the fish out of the skillet and then stir in the freshly chopped parsley and pasta. Serve the pasta with sauce and vegetables topped with a piece of tuna steak."
                      ],
     "photoURL": "https://lh3.googleusercontent.com/-Vqh2rYX5lzk/Th4O24C5HeI/AAAAAAAADjo/fRZ5e2dmYDk/s800/Mediterranean%252520Tuna%252520close.jpg"
     },
     {
     "recipe-name":"Microwave French Toast Mug",
     "vegan": false,
     "vegetarian": true,
     "prepTime": 5,
     "servings": 1,
     "price": 0.84,
     "ingredients": ["1 tsp of butter",
                     "3 tbsp whole milk",
                     "1 tsp maple syrup",
                     "1/4 tsp cinnamon",
                     "1/4 tsp vanilla extract",
                     "Pinch of ground nutmeg",
                     "1 large egg",
                     "1 cup of bread pieces"
                     ],
     "instructions": [
                      "Place the butter in a large mug and microwave for 15-20 seconds, or until it is melted. Add the milk, maple syrup, cinnamon, vanilla, nutmeg, and the egg to the mug and whisk until everything is well mixed.",
                      "Add the bread pieces to the mug and gently stir until all the pieces are saturated with the egg and milk mixture. Be careful not to stir too roughly or the bread pieces may fall apart. Let the bread sit and absorb the liquid for about 1 minute.",
                      "Microwave the mug for 60-90 seconds, or until the mixture is solid. I have a 1250 watt microwave and find that 70-80 seconds is about perfect. You may need to experiment to find just the right cooking time for your microwave and mug size.",
                      "Serve immediately, or deck it out with your favorite toppings, like berries, nuts, or sliced bananas"
                      ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2017/04/Microwave-French-Toast-Mug-V1.jpg"
     },
     {
     "recipe-name":"Mango Coconut Chia Pudding",
     "vegan": true,
     "vegetarian": true,
     "prepTime": 20,
     "servings": 4,
     "price": 4.79,
     "ingredients": ["1/2 lb frozen mango chunks",
                     "13 oz can of lite cocnut milk",
                     "1 tsp of sugar",
                     "6 tbsp of chia seeds"
                     ],
     "instructions": [
                      "If the mango chunks are in large pieces, chop them into smaller, 1/4-inch pieces. Place half of the mango chunks , the coconut milk, and sugar in a blender and process until smooth.",
                      "Divide the remaining mango chunks between 4 small containers (10-12oz. containers). Add 1.5 Tbsp of chia seeds to each container. Finally, pour the mango coconut milk mixture into the containers, dividing it evenly between all four.",
                      "Stir the contents of each container to make sure all the chia seeds have adequate exposure to the liquid. Place lids on the containers and refrigerate over night, or up to 4-5 days."
                      ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2017/05/Mango-Coconut-Chia-Pudding-V2.jpg"
     },
     {
     "recipe-name":"Warm Brussel Sprouts and Pear Salad with Dijon Vinaigrette",
     "vegan": true,
     "vegetarian": true,
     "prepTime": 10,
     "servings": 4,
     "price": 4.61,
     "ingredients": ["1 small clove of garlic",
                     "2 tbsp of olive oil",
                     "1 tbsp of apple cider vinegar",
                     "1/2 tbsp Dijon mustard",
                     "1/8 tsp of salt",
                     "1/4 tsp of sugar",
                     "Freshly cracked pepper",
                     "10 oz of shredded Brussel sprouts",
                     "1/2 tbsp of olive oil",
                     "1 D'anjou pear",
                     "1/3 cup of dried cranberries",
                     "Salt and pepper"
                     ],
     "instructions": [
                      "To make the vinaigrette, mince the garlic and add it to a small bowl with the olive oil, vinegar, Dijon, salt, sugar, and freshly cracked pepper. Whisk the ingredients together until the dressing becomes light and almost creamy in appearance. Set the dressing aside to allow the flavors to blend.",
                      "Place the dried cranberries in a small bowl and add very hot water. Let the cranberries soak for about five minutes, or until they soften slightly. Drain the cranberries and set them aside. Slice the pear into thin strips.",
                      "Heat a large skillet over medium heat. Add 1/2 Tbsp olive oil and tilt the pan until it is covered. Add the shredded Brussels sprouts and sauté them until they begin to soften, but are still bright green (about 5 minutes). Remove them from the heat and season with salt and pepper. They will continue to soften from the residual heat in the skillet.",
                      "Add the pear slices and cranberries to the wilted Brussels sprouts. Drizzle some of the dressing over the salad and toss to combine. Add more dressing as needed. Finish with a final pinch of freshly cracked pepper."
                      ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2016/11/Warm-Brussels-Sprouts-and-Pear-Salad-V.jpg"
     },
     {
     "recipe-name":"Purple Power Bowls",
     "vegan": true,
     "vegetarian": true,
     "prepTime": 30,
     "servings": 5,
     "price": 13.85,
     "ingredients": ["1/3 cup of tahini",
                     "1/3 cup of water",
                     "1/4 cup of lemon juice",
                     "1 clove of crushed garlic",
                     "1/2 tsp of cumin",
                     "1/4 tsp of cayenne pepper",
                     "1/2 tsp of salt",
                     "2.5 cups of cooked rice or other grain",
                     "15 oz. can of chickpeas",
                     "4 oz. bag of baby greens",
                     "2-3 small beets",
                     "2 zucchini",
                     "3 carrots",
                     "1 small red cabbage",
                     "1 avocado",
                     "1/2 bunch of green onion",
                     "1/2 cup pepitas"
                     ],
     "instructions": [
                      "Prepare the dressing by placing all the ingredients in a blender and puréeing until smooth. If you don't have a blender, mince the garlic, then whisk the ingredients together in a bowl. Refrigerate the dressing until ready to use.",
                      "Cool the cooked rice, if needed. Drain the can of chickpeas. Wash the beets, zucchini, and carrots well. Use a food processor or large-holed cheese grater to shred the beets, zucchini, and carrots. Remove any wilted leaves from the cabbage, then cut into quarters, and remove the core. Shred the cabbage using a food processor, or slice thinly with a knife. Slice the avocado and green onion.",
                      "To build the bowls, place about 1/2 cup of the cooked rice in a bowl along with about 1/4 cup of chickpeas. Add a handful of baby greens, shredded beets, zucchini, carrots, and cabbage. Top with a few slices of avocado and a sprinkle of pepitas and sliced onion. Finally, drizzle the lemon tahini dressing liberally over the bowl, then eat."
                      ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2016/08/Purple-Power-Bowl-close.jpg"
     },
     {
     "recipe-name":"Golden Chai",
     "vegan": true,
     "vegetarian": true,
     "prepTime": 5,
     "servings": 4,
     "price": 4.72,
     "ingredients": [
                    "3-4 2-3 inch cinnamon sticks",
                     "1-2 inches fresh ginger, peeled and sliced",
                     "10 whole cloves",
                     "Freshly cracked peper",
                     "4 cups water",
                     "4 bags black tea",
                     "1/2 tsp vanilla extract",
                     "1 tbsp of ground turmeric",
                     "1/4 cup of honey",
                     "4 cups of milk (almond, coconut, whole)"
                     ],
     "instructions": [
                    "Place the cinnamon sticks, sliced ginger, cloves, cracked pepper, and water in a medium sauce pot. Place a lid on the pot and bring it up to a boil over high heat. Once it reaches a boil, reduce the heat to low and let it simmer for five minutes.",
                      "Turn off the heat, add the black tea bags, replace the lid and let the tea steep for 4-5 minutes. Pour the tea into a bowl through a fine mesh strainer or colander.",
                      "Whisk the vanilla, honey, and turmeric into the tea. Taste and adjust the sweetness or other spices, if desired. This Golden Chai tea mix can be refrigerated and saved in the refrigerator for a few days.",
                      "To make each drink, heat 8oz. of milk (stove top, microwave, or steamer) and combine with 8oz. of the hot golden chai tea mix. Make sure to stir the Golden Chai tea mix just before combining with the milk. Serve while hot."
                      ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2017/08/Golden-Chai-duo-H-768x576.jpg"
     },
     {
     "recipe-name":"Ultimate BBQ Chicken Quesadillas",
     "vegan": false,
     "vegetarian": false,
     "prepTime": 15,
     "servings": 5,
     "price": 7.25,
     "ingredients": [
                    "1.5 cups chopped cooked chicken",
                     "15 oz can black beans, drained",
                     "1/4 red onion",
                     "1 jalapeno",
                     "1/2 cup of fresh cilantro",
                     "2 cups shredded cheddar",
                     "1 tsp chili powder",
                     "1/2 tsp smoked paprika",
                     "1/4 tsp salt",
                     "1/2 cup Sweet Baby Ray's BBQ Sauce",
                     "10 7 inch flour tortillas"
                    ],
     "instructions": [
                     "Add the chopped chicken and drained black beans to a large bowl. Finely dice the red onion. Remove the seeds from the jalapeño, then finely dice. Pull the cilantro leaves from their stems and roughly chop. Add the onion, jalapeño, cilantro, shredded cheddar, chili powder, smoked paprika, salt, and BBQ sauce to the bowl with the chicken and beans. Stir until everything is evenly combined.",
                      "Place about 1/3 cup of the BBQ chicken mixture on each tortilla and spread it evenly over one half of the surface. Fold the tortilla closed. Cook the filled and folded tortillas in a dry skillet over medium-low heat, until the outside is brown and crispy, the filling has heated through, and the cheese has melted. Cut each quesadilla in half and serve."
                     ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2017/04/Ultimate-BBQ-Chicken-Quesadillas-square.jpg"
     },
     {
     "recipe-name":"One Pot Sausage and Sun Dried Tomato Pasta",
     "vegan": false,
     "vegetarian": false,
     "prepTime": 5,
     "servings": 4,
     "price": 5.58,
     "ingredients": [
                    "8 oz sweet Italian sausage",
                     "1 tbsp olive oil",
                     "2 cloves garlic, mined",
                     "1/2 lb frozen broccoli florets",
                     "2 cups of chicken broth",
                     "1/3 cup sun dried tomatoes",
                     "8 oz pasta (any small shape)",
                     "Pinch of red pepper",
                     "1/4 cup of grated Parmesan"
                    ],
     "instructions": [
                     "Add the olive oil and sausage to the skillet and cook over medium heat until browned. If using links, cook them until browned on the outside and firm enough to slice, then slice into medallions, return to the skillet, and brown on both sides. Transfer the cooked sausage to a clean bowl and drain off all but about 1 Tbsp fat from the skillet.",
                      "Add the minced garlic and frozen broccoli florets to the skillet. Sauté over medium heat for 3-5 minutes, or just until the broccoli is bright green and no longer frozen. Transfer the broccoli florets to the bowl with the sausage.",
                      "Add the chicken broth to the skillet and stir or whisk to dissolve the browned bits off the bottom of the skillet. Slice the sun dried tomatoes into strips and add them to the broth with the pasta and a pinch of red pepper flakes. Stir, place a lid on top, and turn the heat up to medium high. When the broth begins to boil, give the skillet a quick stir, replace the lid, and turn the heat down to low or just above low so that the broth maintains a simmer.",
                      "Simmer the pasta and sun dried tomatoes for about 7 minutes, stirring every couple of minutes, or until the pasta is tender and most of the liquid is absorbed. If the pasta becomes tender before all the broth has been absorbed, simply let it simmer for the last couple of minutes without the lid.",
                      "Once the pasta is tender and only a small amount of thickened liquid remains in the bottom of the skillet, add the cooked sausage and broccoli back to the pasta. Stir to combine and sprinkle the grated Parmesan over top. Serve immediately."
                     ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2017/03/One-Pot-Sausage-and-Sun-Dried-Tomato-Pasta-V2.jpg"
     },
     {
     "recipe-name":"Easy Orange Chicken",
     "vegan": false,
     "vegetarian": false,
     "prepTime": 10,
     "servings": 4,
     "price": 6.57,
     "ingredients": [
                    "1 large orange",
                     "3 tbsp soy sauce",
                     "1.5 tbsp brown sugar",
                     "1/2 tbsp rice vinegar",
                     "1 tsp grated fresh ginger",
                     "1 clove garlic, mined",
                     "1/4 tsp red pepper flakes",
                     "1/2 tbsp cornstarch",
                     "4 boneless, skinless chicken thighs",
                     "1 large egg",
                     "2 tbsp cornstarch",
                     "4 cups cooked rice",
                     "2 green onions, sliced"
                    ],
     "instructions": [
                     "Remove the zest from the orange using a zester or small-holed cheese grater, then squeeze the juice from the orange. You'll need about 1 tsp zest and 1/2 cup juice. Combine the juice and 1 tsp zest with the soy sauce, brown sugar, rice vinegar, grated ginger, minced garlic, red pepper flakes, and 1/2 Tbsp cornstarch in a small sauce pot. Before placing it over heat, whisk until the cornstarch is fully dissolved. Heat the mixture over medium-low until it begins to simmer, thicken, and turns into a glossy glaze (about 3-5 minutes). Remove the sauce from heat and set it aside.",
                      "Use a sharp knife to remove any excess fat from the chicken thighs, then cut them into small 3/4-inch pieces.",
                      "Combine the egg, 2 Tbsp cornstarch, and a pinch of salt and pepper in a mixing bowl and whisk until the mixture is smooth and frothy. Add the chicken pieces and stir to coat them in the egg mixture.",
                      "Heat a large skillet over medium to medium-high heat. Once hot, add 2 Tbsp cooking oil and swirl to coat the bottom of the skillet. Add the chicken, making sure all the pieces are touching the surface and not piled on top of one another. Let the pieces cook until they are golden brown on the bottom.",
                      "Flip the chicken pieces, breaking them apart from one another as you turn them. Let them cook until golden brown on the second side and cooked through (about 5-7 minutes total cooking).",
                      "Turn the heat off under the skillet and pour on the prepared orange sauce. Stir to coat the chicken pieces in sauce.",
                      "Serve the chicken and sauce over cooked rice, garnished with sliced green onions and any left over orange zest."
                     ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2017/02/Orange-Chicken-V2.jpg"
     },
     {
     "recipe-name":"5 Ingredient Freezer Biscuits",
     "vegan": false,
     "vegetarian": true,
     "prepTime": 10,
     "servings": 12,
     "price": 4.14,
     "ingredients": [
                    "2.5 cups all-purpose flour",
                     "1 tsp salt",
                     "1 tbsp sugar",
                     "4 tsp baking powder",
                     "1 pint heavy whipping cream"
                    ],
     "instructions": [
                     "In a large bowl, stir together the flour, salt, sugar, and baking powder until well combined.",
                      "Pour in the heavy cream and stir until a sticky ball of dough forms. Sprinkle the dough generously with flour and then turn the dough out onto a floured surface. Gently knead the dough 2-3 times, or just until the dough feels mixed and has enough flour that it is no longer sticky. Avoid over working the dough.",
                      "Gently pat the dough down into a 6x8 rectangle, then fold it in half. Repeat this two more times. Folding the dough in this manner helps create layers within the biscuits.",
                      "After folding, pat the dough down into a 6x8 rectangle one final time. The dough should be about one inch thick. Cut the dough into 12 squares.",
                      "Line a baking sheet with parchment, then place the cut biscuits on the parchment, separated just slightly. Cover with plastic wrap and freeze the biscuits for a couple of hours, or just until solid. Label and date a gallon-sized freezer bag. Place the frozen biscuits in the bag for long term storage (3-4 months).",
                      "To bake the biscuits, place any number of biscuits you want on a baking sheet lined with parchment. Let the biscuits thaw only as long as it takes to preheat the oven to 400ºF. Once the oven is preheated, bake the biscuits until puffed up tall and deep golden brown on top. Depending on your oven and size of the biscuits, it should take about 18-22 minutes (frozen), or 16-20 minutes (fresh)."
                     ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2016/10/Freezer-Biscuits-V1.jpg"
     },
     {
     "recipe-name":"Homemade Pineapple Orange Julius",
     "vegan": true,
     "vegetarian": true,
     "prepTime": 5,
     "servings": 1,
     "price": 1.37,
     "ingredients": [
                    "1/4 cup orange juice concentrate",
                     "1/2 cup frozen pineapple",
                     "1/2 tsp vanilla extract",
                     "1 tbsp sugar",
                     "1 cup milk (coconut, almond)"
                    ],
     "instructions": [
                     "Place all the ingredients in a blender and blend until smooth and frothy. Drink immediately.",
                      "For a thicker drink, add a few ice cubes or more frozen pineapple. For a thinner drink, add more milk."
                     ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2016/08/Pineapple-Orange-Julius-V1.jpg"
     },
     {
     "recipe-name":"Spaghetti Carbonara",
     "vegan": false,
     "vegetarian": false,
     "prepTime": 10,
     "servings": 4,
     "price": 4.31,
     "ingredients": [
                    "3 oz bacon",
                     "2 cloves garlic",
                     "12 oz spaghetti",
                     "3 large eggs",
                     "3/4 cup grated Parmesan",
                     "Freshly cracked pepper",
                     "Salt to taste",
                     "Handful fresh parsley (optional)"
                    ],
     "instructions": [
                     "Fill a large pot with water for the pasta and season with salt. Place a lid on the pot and bring it up to a boil over high heat.",
                      "Fill a large pot with water for the pasta and season with salt. Place a lid on the pot and bring it up to a boil over high heat.",
                      "In a medium bowl, whisk together the eggs, 1/2 cup of the Parmesan, and a generous dose of freshly cracked pepper.",
                      "The water should be boiling at this point, so add the pasta, stir well, and continue to boil the pasta until al dente. Reserve one cup of the starchy pasta cooking water, then drain the pasta in a colander.",
                      "Add 1/4 cup of the reserved pasta water to the skillet that was used to cook the bacon. Stir the warm water in the skillet and dissolve the browned bits from the surface of the skillet. Add the steaming hot drained pasta to the skillet and toss in the bacon liquid in the skillet.",
                      "Pour the egg and Parmesan mixture over the hot pasta and immediately begin to stir or toss the pasta. Continue to stir the hot pasta in the egg mixture until a creamy sauce forms. Add the remaining Parmesan, a little more freshly cracked pepper, and the reserved bacon bits, and toss again. If the pasta becomes too thick or dry, add a splash more of the reserved pasta water.",
                      "Finally, taste the pasta and adjust the salt, Parmesan, or pepper if needed. Top with a pinch or two of roughly chopped parsley leaves."
                     ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2016/05/Spaghetti-Carbonara-Vs.jpg"
     },
     {
     "recipe-name":"Pesto Hummus",
     "vegan": true,
     "vegetarian": true,
     "prepTime": 10,
     "servings": 8,
     "price": 4.03,
     "ingredients": [
                    "15 oz can chickpeas",
                    "1/4 cup lemon juice",
                     "1/4 cup olive oil",
                     "1/4 cup tahini",
                     "1/4 cup basil pesto (dairy free options)",
                     "1/8 tsp salt",
                     "1/8 tsp garlic powder (or 1 fresh clove)"
                    ],
     "instructions": [
                     "Drain the chickpeas and add them to a food processor along with the rest of the ingredients.",
                      "Process the ingredients until smooth, adding a little water, olive oil, or drained liquid from the chickpeas to thin out the mixture if needed.",
                      "Garnish with a few whole chickpeas, a drizzle of olive oil, or a dollop of pesto, if desired."
                     ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2016/03/Pesto-Hummus-V.jpg"
     },
     {
     "recipe-name":"Nam asod (Thai Pork Salad)",
     "vegan": false,
     "vegetarian": false,
     "prepTime": 10.31,
     "servings": 4,
     "price": 10.31,
     "ingredients": [
                    "1/4 cup fresh lime juice",
                     "1 tbsp fish sauce",
                     "1.5 tbsp grated fresh ginger",
                     "1/2 tbsp chili garlic sauce or sambal oelek",
                     "1 lb ground pork or turkey",
                     "1 clove garlic",
                     "1/2 tbsp canola oil",
                     "1 carrot",
                     "1/4 bunch cilantro",
                     "1/2 cup unsalted peanuts",
                     "4 cups cooked rice (optional)"
                    ],
     "instructions": [
                     "Make the dressing first to allow the flavors time to blend. In a small bowl combine the fresh lime juice, fish sauce, fresh grated ginger, and chili garlic sauce. Stir to combine, taste, and adjust the fish sauce, chili garlic sauce, or ginger to your liking. The dressing should be very potent.",
                      "Add the ground pork to a large non-stick skillet along with 1/2 Tbsp canola oil and one minced clove of garlic. Cook the pork over medium heat, breaking it up into small pieces as it cooks, until it is cooked through (about five minutes). Drain off any excess fat and allow the pork to cool a few minutes, or until it is no longer hot.",
                      "While the pork is cooking, peel and shred the carrot using a large holed cheese grater or mandolin. Slice the red onion into very thin strips. Pull the cilantro leaves from the stems.",
                      "Transfer the cooled pork to a bowl, add the prepared dressing, and stir to combine. Add the shredded carrot, sliced red onion, cilantro, and peanuts. Stir to combine again. Serve the salad over a bed of cooked rice, shredded greens, or fill large lettuce leaves with the mixture for lettuce wraps."
                     ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2016/01/Nam-Sod-text2.jpg"
     },
     {
     "recipe-name":"Garlic Parmesan Polenta",
     "vegan": false,
     "vegetarian": true,
     "prepTime": 5,
     "servings": 6,
     "price": 0.93,
     "ingredients": [
                    "1 cup yellow cornmeal",
                     "3.5 cups water",
                     "3/4 tsp salt",
                     "2 tbsp butter",
                     "1/4 cup grated Parmesan",
                     "1/4 tsp garlic powder",
                     "1 tbsp canola or vegetable oil"
                    ],
     "instructions": [
                     "Add the water and salt to a sauce pot and bring to a boil over high heat.",
                      "Once boiling, add the polenta while continuously whisking to prevent lumps. Turn the heat down to low and let simmer until thickened (this will depend on the type of cornmeal you have--mine only took about two minutes).",
                      "Once thickened, stir in the butter, grated Parmesan, and garlic powder until smooth. Serve warm, or spread the mixture out into a square or round casserole dish and let cool in the refrigerator, uncovered, until solid.",
                      "Slice the solid polenta. Add a small amount of canola or vegetable oil to a non-stick skillet and warm over medium heat. Once the oil is hot and glistening, but not smoking, add the polenta slices and cook until golden on each side. Add more oil as needed to fry the remaining slices."
                     ],
     "photoURL": "http://www.budgetbytes.com/wp-content/uploads/2015/11/Garlic-Parmesan-Polenta-text.jpg"
     },
     {
     "recipe-name":"Spicy Peanut Noodle Salad",
     "vegan": true,
     "vegetarian": true,
     "prepTime": 15,
     "servings": 6,
     "price": 6.99,
     "ingredients": [
                    "1/2 inch fresh ginger, grated",
                     "1 clove garlic, minced",
                     "1/3 cup hoisin sauce",
                     "1/3 cup crunchy 'natural style' peanut butter",
                     "1 tbsp Sriracha",
                     "1 tbsp fresh lime juice",
                     "1/3 cup hot water",
                     "1 red bell pepper",
                     "1 yellow bell pepper",
                     "3 carrots",
                     "1 bunch green onions",
                     "1/2 bunch fresh cilantro",
                     "8 oz linguine"
                    ],
     "instructions": [
                     "Grate the ginger using a small holed cheese grater into a bowl. Add the minced garlic, sriracha, hoisin sauce, peanut butter, and lime juice. Stir until everything is combined (it may be slightly clumpy), then add 1/3 cup hot water and stir until everything is smooth. Taste and add more lime juice if desired.",
                      "Bring a large pot of water to a boil for the pasta. When the water reaches a boil, break the pasta in half** then add it to the water. Boil the pasta for 7-10 minutes, or until al dente. Drain the pasta in a colander and allow it to cool.",
                      "While the pasta is boiling, prepare the fresh vegetables. Thinly slice the yellow and red bell peppers. Use a spiralizer or a vegetable peeler to make thin strips out of the carrots, or use a large holed cheese grater to grate them into smaller pieces. Thinly slice the green onions. Pull the cilantro leaves from the stems and either leave them whole or give them a rough chop. Place the prepared bell peppers, carrots, green onion, and cilantro into a large bowl.",
                      "Once the pasta is drained and completely cooled***, add it to the bowl with the vegetables. Pour the peanut sauce over top, then toss until everything is evenly coated. Serve immediately or refrigerate until ready to serve."
                     ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2015/09/Spicy-Peanut-Noodle-Salad-text.jpg"
     },
     {
     "recipe-name":"Carmelized Banana and Peanut Butter Quesadilla",
     "vegan": false,
     "vegetarian": true,
     "prepTime": 5,
     "servings": 1,
     "price": 0.49,
     "ingredients": [
                    "1 ripe banana",
                     "1 small flour tortilla",
                     "1 tbsp peanut butter",
                     "1/2 tbsp butter",
                     "1/2 tbsp brown sugar",
                     "Dash of cinnamon"
                    ],
     "instructions": [
                      "Slice the banana. Melt the butter in a small skillet over medium heat. Once melted, add the sliced banana and brown sugar. Cook the banana in the butter and brown sugar until the slices turn golden brown and slightly sticky. Remove the skillet from the heat.",
                      "Spread the peanut butter over half of the quesadilla. Scoop the caramelized banana slices onto the peanut butter. Sprinkle a dash of cinnamon on top. Fold the empty half of the tortilla over the filled side.",
                      "Place the quesadilla in a clean dry skillet and cook over medium heat until golden brown and crispy on both sides. Slice the quesadilla into triangles using a large knife or pizza cutter, then serve."
                    ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2015/09/PB-Bananas-Cinnamon.jpg"
     },
     {
     "recipe-name":"Chicken Kale Caesar Wraps",
     "vegan": false,
     "vegetarian": false,
     "prepTime": 30,
     "servings": 4,
     "price": 8.56,
     "ingredients": [
                    "1 bunch lacinto kale",
                     "1 15 oz can chickpeas",
                     "2 carrots",
                     "1/2 rotisserie chicken",
                     "1/4 cup grated Parmesan",
                     "Freshly cracked pepper",
                     "1/4 cup creamy Caesar dressing",
                     "4 large tortillas"
                     ],
     "instructions": [
                     "Remove the stems from the kale leaves by running a sharp knife along each side of the stem from top to bottom. Stack the de-stemmed leaves, then cut crosswise into thin strips. Place the chopped kale into a colander and rinse well with cool water. Let as much water drain away as possible. Use a salad spinner of blot with a clean, lint-free towel to remove as much moisture as possible. Place the cleaned and dried kale into a large bowl.",
                      "Drain and rinse the chickpeas. Peel the carrots, then shred them using a large holed cheese grater. Remove the chicken meat from the carcass, then roughly chop into small pieces. Add the chickpeas, carrots, chopped chicken, and Parmesan to the bowl with the kale.",
                      "Add 1/4 cup Caesar dressing to the bowl, then stir until everything is evenly coated. Add one heaping cup of the salad mix to the center of a large tortilla. Add some freshly cracked pepper, if desired. Fold in the sides of the tortilla, then roll it up like a burrito. Serve immediately or refrigerate up to a day."
                      ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2015/07/Chicken-Kale-Caesar-Wrap-front.jpg"
     },
     {
     "recipe-name":"Crunchy Chinese Chicken Salad",
     "vegan": false,
     "vegetarian": false,
     "prepTime": 20,
     "servings": 8,
     "price": 9.62,
     "ingredients": [
                    "1/4 cup Canola or vegetable oil",
                     "3 tbsp rice vinegar",
                     "1 tbsp honey",
                     "1 tsp soy sauce",
                     "1/2 tsp ground ginger (dried)",
                     "1/8 tsp garlic powder",
                     "1/2 tsp toasted sesame oil",
                     "Freshly cracked pepper",
                     "1 head of Napa cabbage",
                     "2 carrots",
                     "4 green onions",
                     "1/4 cup sliced almonds",
                     "1 3 oz pkg uncooked ramen noodles, seasoning discarded",
                     "1/2 rotisserie chicken"
                     ],
     "instructions": [
                     "Prepare the dressing first by combining the oil, vinegar, honey, soy sauce, ginger, garlic powder, sesame oil, and pepper in a jar or bowl. Shake the jar or whisk the ingredients in a bowl until combined. The dressing will separate a bit as it sits, but will be stirred again prior to adding to the salad.",
                      "Rinse the cabbage well and shake off as much excess moisture as possible. Slice the cabbage into thin strips and add it to a bowl (about 8 cups of shredded cabbage). Peel the carrots and then shred them using a large holed cheese grater. Slice the green onions. Add the carrots, green onions, and almonds to the bowl.",
                      "Before opening the package of ramen, crush the noodles using the heel of your hand. Open the package, discard the seasoning envelope, and add the crushed noodles to the bowl.",
                      "Pull the meat from half of a rotisserie chicken, then chop it into small pieces (or use two cups of pre-cooked chopped chicken). Add the chicken to the bowl. Give the dressing a brief stir, then pour it over the salad ingredients in the bowl. Stir until everything is evenly coated in dressing, then serve."
     
                      ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2015/07/Chinese-Chicken-Salad-front.jpg"
     },
     {
     "recipe-name":"Blackberry Sage Pork Chops",
     "vegan": false,
     "vegetarian": false,
     "prepTime": 5,
     "servings": 4,
     "price": 6.31,
     "ingredients": [
                    "4 thin center cut pork chops",
                     "Pinch of salt and pepper",
                     "1 tbsp olive oil",
                     "1/2 cup blackberry jam or preserves",
                     "1 tbsp butter",
                     "2 tbsp balsamic vinegar",
                     "1 tbsp water",
                     "1/2 tsp dried sage",
                     "1/8 tsp salt"
                    ],
     "instructions": [
                     "Take the chops out of the refrigerator and let them warm on the countertop for about 10 minutes. Remove them from the package, pat dry with a paper towel, then season both sides of each chop with a pinch of salt and pepper.",
                      "Heat 1 Tbsp of olive oil in a large skillet over medium to medium-high heat. Once the oil is hot (it should appear wavy on the surface, but not be smoking), add the chops. Let the pork chops cook until browned on each side (3-5 minutes per side), then transfer them to a clean plate. Remove the skillet from the heat.",
                      "Let the skillet cool for just a couple of minutes, then add the blackberry jam, butter, balsamic vinegar, water, and sage. Return the skillet to the burner and turn the heat on to low. Whisk the ingredients together until the jam and the browned bits on the bottom of the skillet have dissolved into the sauce. Turn the heat up to medium and let the sauce come to a simmer. Let the sauce simmer over medium heat until it's thick enough to coat a spoon (5 minutes or so). Turn the heat off, taste the sauce, and add salt as needed (I added 1/8 tsp).",
                      "Return the chops and any juices that have accumulated on the plate to the sauce. Coat each side of the chops in the sauce and let them warm through in the simmering sauce. Spoon the sauce over each chop after plating."
                      ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2015/04/Blackberry-Sage-Pork-Chops-skillet.jpg"
     },
     {
     "recipe-name":"Parmesan Portobello Orzo",
     "vegan": false,
     "vegetarian": false,
     "prepTime": 10,
     "servings": 6,
     "price": 5.22,
     "ingredients": [
                    "2 tbsp olive oil",
                     "2 cloves garlic",
                     "8 oz baby portobello mushrooms",
                     "Pinch of salt and pepper",
                     "2 cups uncooked orzo",
                     "3 cups chicken broth",
                     "1/3 cup grated Parmesan"
                     ],
     "instructions": [
                     "Rinse the mushrooms and cut them into thick slices. Mince the garlic. Heat the garlic and olive oil in a large skillet over medium heat for one to two minutes, or until the garlic is soft and fragrant. Add the mushrooms, a pinch of salt and freshly cracked pepper, and continue to sauté until the mushrooms have softened and released all of their moisture (5-7 minutes).",
                     "Add the uncooked orzo and chicken broth to the skillet. Give it a quick stir, place a lid on top, and let the mixture come up to a boil. Once it reaches a boil, give it quick stir again to loosen any pasta from the bottom of the skillet. Replace the lid, turn the heat down to low, and let the pasta simmer on low heat for 10 minutes. Stir once half way through to prevent the pasta from sticking.",
                    "After ten minutes, test the orzo to make sure it's tender (if not, replace the lid and let simmer a few minutes more). Stir the contents of the skillet to redistribute any leftover broth (it will continue to absorb into the pasta). Once the broth has absorbed, turn off the heat.",
                    "Sprinkle the Parmesan over the pasta, stir, and then serve."
                      ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2014/12/Parmesan-Portobello-Orzo.jpg"
     },
     {
     "recipe-name":"Blackened Tilapia",
     "vegan": false,
     "vegetarian": false,
     "prepTime": 10,
     "servings": 4,
     "price": 4.19,
     "ingredients": [
                    "1 tbsp smoked paprika",
                     "1 tsp cumin",
                     "1 tsp thyme",
                     "1 tsp oregano",
                     "1/4 tsp cayenne pepper",
                     "1/4 tsp garlic powder",
                     "1/4 tsp salt",
                     "Freshly cracked pepper, about 20 cranks of a pepper mill",
                     "1 tbsp butter",
                     "4 Tilapia filets, 4 oz each"
                     ],
     "instructions": [
                     "In a small bowl, combine the paprika, cumin, thyme, oregano, cayenne, garlic, salt, and pepper. Liberally coat both sides of each tilapia filet with the spices. The moisture from the filet will help the spices adhere. If the fish is very wet, pat it dry with a paper towel before beginning, so that it is just damp.",
                      "Melt 1 Tbsp of butter in a skillet over medium heat until it begins to foam. Add two of the fish filets at a time and cook for about two minutes on each side, or until the spices have turned a deep burgundy color and the fish is cooked through. Repeat with the second two filets, adding more butter before beginning, if needed. Serve hot."
                      ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2014/06/Blackened-Tilapia-front.jpg"
     },
     {
     "recipe-name":"Green Gazpacho",
     "vegan": true,
     "vegetarian": true,
     "prepTime": 15,
     "servings": 4,
     "price": 4.39,
     "ingredients": [
                    "2 medium cucumbers",
                     "1 medium white onion",
                     "1 medium green bell pepper",
                     "1 clove garlic",
                     "1 medium avocado",
                     "1/4 bunch fresh parsley",
                     "1/4 bunch fresh cilantro",
                     "2 tbsp olive oil",
                     "1 tsp salt",
                     "1 tbsp lemon juice",
                     "1 cup water"
                     ],
     "instructions": [
                     "Remove the ends from the cucumber and slice it in half lengthwise. Scrape the seeds out with a spoon and then chop the cucumber into chunks. Remove the seeds from the bell pepper and also cut it into chunks. Dice the onion. Add the cucumber, bell pepper, onion, and garlic (peeled) to a food processor. Process until the vegetables are minced.",
                    "Pull the leaves from about 1/4 of the parsley and cilantro bunches. Add the leaves to the food processor along with the olive oil and the flesh from the avocado. (Need help learning how to cut the avocado? Check this tutorial.) Purée until smooth.",
                    "Add the water, one tablespoon of lemon juice, and one teaspoon of salt. Purée until smooth again. Taste the soup and adjust the salt or lemon juice if desired.",
                    "Serve immediately or chill until ready to eat."
                      ],
     "photoURL": "https://www.budgetbytes.com/wp-content/uploads/2013/06/Green-Gazpacho-front2.jpg"
     },
     {
     "recipe-name":"Apple Nut Quinoa",
     "vegan": true,
     "vegetarian": true,
     "prepTime": 5,
     "servings": 4,
     "price": 4.54,
     "ingredients": [
                    "1 cup uncooked quinoa",
                     "1 1/2 cups apple juice",
                     "1/4 tsp salt",
                     "1/2 tsp cinnamon",
                     "1/16 tsp ground cloves (pinch)",
                     "1 medium apple",
                     "1/2 cup walnuts"
                     ],
     "instructions": [
                     "Place the quinoa in a wire sieve and rinse thoroughly for 1-2 minutes with cool water. If you don’t have a wire mesh sieve, place the quinoa in a bowl, fill it with cool water and swish the quinoa around. Allow it to settle and then carefully pour out the water. Repeat 4-5 times. Rinsing quinoa well is essential to remove its natural coating, which can cause the quinoa to taste bitter.",
                    "Place the rinsed quinoa in a medium pot. Add the juice, salt, cinnamon, and cloves. Stir briefly. Place a lid on top and bring the pot up to a boil over high heat. As soon as it reaches a boil, turn the heat down to low and allow it to simmer for 15 minutes. After 15 minutes, turn the heat off and allow it to rest, without removing the lid, for ten minutes.",
                    "Meanwhile, chop the apple into small bite-sized pieces. Also roughly chop the walnuts.",
                    "After the quinoa has cooked and rested, remove the lid and fluff it with a fork. Add the apples and walnuts and stir them and then eat!"
                      ],
     "photoURL": "https://lh5.googleusercontent.com/-jOA5XxK9LDk/UM-8Q-CGLQI/AAAAAAAAJEg/Exru7NyXV9w/s640/Apple+Nut+Quinoa+close.jpg"
     },
     {
     "recipe-name":"Basic Bok Choy",
     "vegan": true,
     "vegetarian": true,
     "prepTime": 10,
     "servings": 6,
     "price": 2.65,
     "ingredients": [
                    "1 2-3 lbs large head bok choy",
                     "2 tbsp olive oil",
                     "1/2 tsp salt",
                     "1 clove garlic, minced",
                     "1/2 inch peeled, minced ginger",
                     "1 tsp sesame oil",
                     "1 tsp sesame seeds"
                     ],
     "instructions": [
                     "Remove all of the leaves of the bok choy from the root base and clean well under running water. Cut each leave/stem into 2 inch chunks. If you don’t like the fibrous bottom of the stem, you can discard it. I cut off about one inch from the bottom of each stem.",
                    "In a large skillet or wok, heat the olive oil over medium/high heat. When it is hot, saute the minced garlic and ginger for 1-2 minutes or until softened slightly.",
                    "Add all of the bok choy to the skillet along with 1/2 tsp of salt (this will help it wilt). Stir and saute until the bok choy has wilted and the thick pieces of stalk have become slightly transparent (about 5 minutes). Remove from the heat, adjust salt as needed, drizzle with sesame oil and sprinkle with sesame seeds."
                      ],
     "photoURL": "http://lh6.ggpht.com/_OaYG005JPDs/S9GmxLmYhTI/AAAAAAAABMw/Wel81SxJmjU/s640/bok%20choy%20top.jpg"
     }
]}

